The hanger is out of its host and will be disconnected.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
 Syntax
  C#
public static FailureDefinitionId FabricationHangerOutOfHost { get; }
  Visual Basic
Public Shared ReadOnly Property FabricationHangerOutOfHost As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ FabricationHangerOutOfHost {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures MEPFabricationFailures Class
  Autodesk.Revit.DB Namespace